## Εστίαση σε συγκεκριμένες γραμμές  (rows)

In [56]:
import pandas as pd

In [57]:
#Create dataframe alternative 1
data = {'Name': pd.Series(data=['Alex', 'Bob', 'Clarke'], index = ['a','b','c']),
        'Age' :  pd.Series(data=[10, 12, 13], index=['a','b','c'])}

df = pd.DataFrame(data=data, columns=['Name','Age']) #Named Indexes

print(df)

     Name  Age
a    Alex   10
b     Bob   12
c  Clarke   13

In [58]:
#Create dataframe alternative 2

data = [['Alex',10],['Bob',12],['Clarke',13]]
df = pd.DataFrame(data=data, columns=['Name','Age'], index=['a','b','c']) #Named Indexes
print (df)

     Name  Age
a    Alex   10
b     Bob   12
c  Clarke   13

### Επιστροφή συγκεκριμένης (ων) γραμμής(ών) -> Series

##### 1. Επιλογή γραμμών χρησιμοπoιώντας τα labels δηλαδή τα Named Indexes και τη μέθοδο loc

In [59]:
#df[0] #wrong syntax!!!! THIS IS NOT WORKING

In [60]:
print(df.loc['a'])#Selection by Label
print(type(df.loc['a'])) #<class 'pandas.core.series.Series'>

print()

print(df.loc[['a','c']]) #Selection by Label
print(type(df.loc[['a','c']]))# <class 'pandas.core.frame.DataFrame'>

Name    Alex
Age       10
Name: a, dtype: object
<class 'pandas.core.series.Series'>

     Name  Age
a    Alex   10
c  Clarke   13
<class 'pandas.core.frame.DataFrame'>

##### 2. Ίδιο αποτέλεσμα αλλά με τη χρήση positional indexing και τη μέθοδο iloc

In [61]:
print(df.iloc[0])#refer to the row index
print(type(df.iloc[0]))#Series
print()

print(df.iloc[[0,2]]) #Return row 0 and 2
print(type(df.iloc[[0,2]]))#DataFrame

print()

print(df.iloc[0:2]) #Return rows between indexes [0,2), this cannot be done with loc function
print(type(df.iloc[0:2]))#DataFrame

Name    Alex
Age       10
Name: a, dtype: object
<class 'pandas.core.series.Series'>

     Name  Age
a    Alex   10
c  Clarke   13
<class 'pandas.core.frame.DataFrame'>

   Name  Age
a  Alex   10
b   Bob   12
<class 'pandas.core.frame.DataFrame'>

### Επιστροφή συγκεκριμένης τιμής (value) με  τη χρήση των μεθόδων at & iat

In [62]:
df#to remember our df

     Name  Age
a    Alex   10
b     Bob   12
c  Clarke   13

In [63]:
print(df.at['a','Name'])#using labels

Alex

In [64]:
print(df.iat[0,0])# using positional indexing, 'c' column has index ->2
#print(df.iat[0,'Age'])# 'This is wrong, both values should be positional indexing

Alex

In [65]:
df = pd.DataFrame(data=data,columns=['Name','Age'], index=[34,11,0]) #Named Indexes
df

      Name  Age
34    Alex   10
11     Bob   12
0   Clarke   13

In [66]:
#Labels can look like positional indexing, but there are different
print(df.iat[0,0]) #position 0
print(df.at[34,'Name'])#label 34
print()
print(df.iat[2,0])
print(df.at[0,'Name'])

Alex
Alex

Clarke
Clarke

### Αλλαγή συγκεκριμένης τιμής (value) με  τη χρήση των μεθόδων at & iat

In [67]:
df = pd.DataFrame(data=data,columns=['Name','Age'], index=['a','b','c']) #Named Indexes
df

     Name  Age
a    Alex   10
b     Bob   12
c  Clarke   13

In [68]:
print("Tιμή προ αλλαγής  :",df.at['a','Age'])
df.at['a','Age'] = 30
print("Tιμή μετά αλλαγής :",df.at['a','Age'])
print(df)
print()
df.iat[0,1] = 24 # 'Age' column has index ->1
print("Tιμή μετά αλλαγής :",df.iat[0,1])
print(df)

Tιμή προ αλλαγής  : 10
Tιμή μετά αλλαγής : 30
     Name  Age
a    Alex   30
b     Bob   12
c  Clarke   13

Tιμή μετά αλλαγής : 24
     Name  Age
a    Alex   24
b     Bob   12
c  Clarke   13

### Ασκήσεις

In [69]:
data = [['bananas',10],['oranges',12],['apples',13]]

In [70]:
#Άσκηση 1
#Εισάγετε την σωστή μέθοδο από τη βιβλιοθήκη Pandas για να δημιουργήσετε ένα DataFrame χρησιμοποιώντας τη λίστα data.

In [71]:
#Άσκηση 2
#Εκτυπώστε όλο το DataFrame που δημιουργήσατε στο παραπάνω βήμα

In [72]:
# Άσκηση 3
#Εκτυπώστε τις πρώτες 2 γραμμές του DataFrame χρησιμοποιώντας τη μέθοδο head

In [73]:
#Άσκηση 4
#Δημιουργήστε ένα Dataframe με τα δεδομένα της λίστας data και προσθέστε ως δείκτες τις τιμές a,b,c

In [74]:
#Άσκηση 5
#Εκτυπώστε τη γραμμή (row) του παραπάνω DataFrame που βρίσκεται στο index 0

In [75]:
#Άσκηση 6
#Εκτυπώστε τη γραμμή του παραπάνω DataFrame που έχει label το 'c'

## Αλλαγές στη δομή των DataFrames

In [76]:
import pandas as pd

d = {'one' : pd.Series(data=[1, 2, 3],    index=['a', 'b', 'c']),
     'two' : pd.Series(data=[1, 2, 3, 4], index=['a', 'b', 'c', 'd'])}

df = pd.DataFrame(d)
print(df)

   one  two
a  1.0    1
b  2.0    2
c  3.0    3
d  NaN    4

### Προσθήκη στήλης (column)

In [77]:
# Προσθήκη Στήλης (column)
df['three']=pd.Series(data=[10,20,30],index=['a','b','d']) #the list of index is necessary 
print (df)

   one  two  three
a  1.0    1   10.0
b  2.0    2   20.0
c  3.0    3    NaN
d  NaN    4   30.0

In [78]:
# Προσθήκη Στήλης (column) που προκύπτει από το άθροισμα άλλων στηλών
df['four']=df['one']+df['three']+3

print (df)

   one  two  three  four
a  1.0    1   10.0  14.0
b  2.0    2   20.0  25.0
c  3.0    3    NaN   NaN
d  NaN    4   30.0   NaN

### Προσθήκη γραμμών (rows)

In [79]:
#Adding one row
df2 = pd.DataFrame([[5, 6,100,45]], columns = ['one','two', 'three','four'], index=[5])
df=df.append(df2, ignore_index = True)# add new rows using append method

print (df)

   one  two  three  four
0  1.0    1   10.0  14.0
1  2.0    2   20.0  25.0
2  3.0    3    NaN   NaN
3  NaN    4   30.0   NaN
4  5.0    6  100.0  45.0

In [80]:
#Adding multiple rows
df2 = pd.DataFrame([ [7, 8,200,78],[0,3,300,20] ], columns = ['one','two', 'three','four'], index=[6,7])
df=df.append(df2, ignore_index = True)# add new rows using append method

print (df)

   one  two  three  four
0  1.0    1   10.0  14.0
1  2.0    2   20.0  25.0
2  3.0    3    NaN   NaN
3  NaN    4   30.0   NaN
4  5.0    6  100.0  45.0
5  7.0    8  200.0  78.0
6  0.0    3  300.0  20.0

### Διαγραφή στήλης

##### Χρήση του keyword del

In [81]:
del df['four']# using del
print (df)

   one  two  three
0  1.0    1   10.0
1  2.0    2   20.0
2  3.0    3    NaN
3  NaN    4   30.0
4  5.0    6  100.0
5  7.0    8  200.0
6  0.0    3  300.0

##### Χρήση της μεθόδου pop

In [82]:
df.pop('two')# using pop method

0    1
1    2
2    3
3    4
4    6
5    8
6    3
Name: two, dtype: int64

In [83]:
df

   one  three
0  1.0   10.0
1  2.0   20.0
2  3.0    NaN
3  NaN   30.0
4  5.0  100.0
5  7.0  200.0
6  0.0  300.0

##### Χρήση της μεθόδου drop

In [84]:
df.drop('one',axis=1)#using drop method, remember if you need to use inplace argument
df

   one  three
0  1.0   10.0
1  2.0   20.0
2  3.0    NaN
3  NaN   30.0
4  5.0  100.0
5  7.0  200.0
6  0.0  300.0

In [85]:
df=df.drop('one',axis=1, inplace=True)#using drop method, remember if you need to use inplace argument

In [86]:
print(df)

None

### Διαγραφή γραμμής

In [87]:
df = pd.DataFrame(data=[[1, 2, 8], [3, 4, 10],[89, 8, 1],[6, 6, 6],[36, 36, 36],[101, 101, 101]], columns = ['a','b','c'], index=['aa','bb','cc','dd','ee','ff'])
df

      a    b    c
aa    1    2    8
bb    3    4   10
cc   89    8    1
dd    6    6    6
ee   36   36   36
ff  101  101  101

In [88]:
df.drop('bb',axis=0)#using drop method to remove row using single label or list-like indexes

      a    b    c
aa    1    2    8
cc   89    8    1
dd    6    6    6
ee   36   36   36
ff  101  101  101

In [89]:
df# remember that drop needs inpace argument to make changes to the original dataframe

      a    b    c
aa    1    2    8
bb    3    4   10
cc   89    8    1
dd    6    6    6
ee   36   36   36
ff  101  101  101

In [90]:
df.drop('bb',axis=0, inplace = True)#using drop method to remove row using single label or list-like indexes
df

      a    b    c
aa    1    2    8
cc   89    8    1
dd    6    6    6
ee   36   36   36
ff  101  101  101

In [91]:
df.drop(['aa','dd'],axis=0,inplace = True)#using drop method to remove row using single label or list-like indexes

In [92]:
df

      a    b    c
cc   89    8    1
ee   36   36   36
ff  101  101  101

In [93]:
#Σημαντική διαφορά στη σύνταξη όταν θέλουμε να διαγράψουμε γραμμές χρησιμοποιώντας indexes
#Δεν παίρνει απλά ως όρισμα μια λίστα στοιχείων αλλά μια λίστα indexes
rows = df.index[[0,1]]
df.drop(rows,axis=0,inplace = True)#using drop method to remove row using single label or list-like indexes

In [94]:
df

      a    b    c
ff  101  101  101

In [95]:
#Στην παραπάνω διαφορά πατά η σύνταξη όταν επιθυμούμε να διαγράψουμε κάποιες γραμμές βάσει μιας συνθήκης
df.drop(df.index[df['a'] >100], inplace = True)
df

Empty DataFrame
Columns: [a, b, c]
Index: []

### Διαγραφή DataFrame

In [96]:
print(type(df)) # Df still exists but it is empty
print(df.columns)
print(df.head())

<class 'pandas.core.frame.DataFrame'>
Index(['a', 'b', 'c'], dtype='object')
Empty DataFrame
Columns: [a, b, c]
Index: []

In [97]:
del df

In [98]:
#type(df)#df does no longer exist

## Επιλογή υποσυνόλου δεδομένων βάσει συνθηκών

In [99]:
lst = [['banana','yellow',1.10],['orange','orange',2.65], ['cherry','red'],[ 'kiwi','green',2.30]]
df = pd.DataFrame(data=lst, columns = ['fruit','colour','price'], index = ['fruit1','fruit2','fruit3','fruit4'])#added list of index
print(df)

         fruit  colour  price
fruit1  banana  yellow   1.10
fruit2  orange  orange   2.65
fruit3  cherry     red    NaN
fruit4    kiwi   green   2.30

In [100]:
print(type(df['price']))#series
df['price']#Return the values of column price

<class 'pandas.core.series.Series'>

fruit1    1.10
fruit2    2.65
fruit3     NaN
fruit4    2.30
Name: price, dtype: float64

In [101]:
print(type(df[['price']]))#dataframe
df[['price']]#Return the column price

<class 'pandas.core.frame.DataFrame'>

        price
fruit1   1.10
fruit2   2.65
fruit3    NaN
fruit4   2.30

In [102]:
df[['fruit','price']]#Return the columns fruit and price

         fruit  price
fruit1  banana   1.10
fruit2  orange   2.65
fruit3  cherry    NaN
fruit4    kiwi   2.30

In [109]:
df['price']>2

fruit1    False
fruit2     True
fruit3    False
fruit4     True
Name: price, dtype: bool

In [103]:
df[df['price']>2] #return subset (rows) where price>2

         fruit  colour  price
fruit2  orange  orange   2.65
fruit4    kiwi   green   2.30

In [110]:
fruits_with_price_over_2 = df[df['price']>2]['fruit']#return fruits with price>2
print(fruits_with_price_over_2)#series
print()

fruit2    orange
fruit4      kiwi
Name: fruit, dtype: object

In [105]:
#Let's convert series to list which is more easy to handle
fruits_with_price_over_2 = fruits_with_price_over_2.tolist()
print(fruits_with_price_over_2)#list
print('The first element (fruit) of the list is :',fruits_with_price_over_2[0])

['orange', 'kiwi']
The first element (fruit) of the list is : orange

In [106]:
df[df['price']>2][['fruit','price']]#return columns fruit and price for rows which have price>2

         fruit  price
fruit2  orange   2.65
fruit4    kiwi   2.30

In [107]:
#return columns fruit and price for rows which have price>2 and (&) their fruit value contains 'ki' substring
#Parentheses () ARE NESSESARY
df[(df['price']>2) & (df['fruit']).str.contains('ki')][['fruit','price']]#return subset

       fruit  price
fruit4  kiwi    2.3

In [116]:
df[(df[df.columns[2]]>2) & (df[df.columns[0]]).str.contains('ki')][[df.columns[0],df.columns[2]]]#return subset using column indexes

       fruit  price
fruit4  kiwi    2.3

In [108]:
df#nothing has changed to the original datase

         fruit  colour  price
fruit1  banana  yellow   1.10
fruit2  orange  orange   2.65
fruit3  cherry     red    NaN
fruit4    kiwi   green   2.30

In [ ]:
for column in df.columns